tap "1password/tap"
tap "arkweid/lefthook"
tap "aws/tap"
tap "bufbuild/buf"
tap "cloudflare/cloudflare"
tap "dart-lang/dart"
tap "filippo.io/age", "https://filippo.io/age"
tap "guumaster/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "knqyf263/utern"
tap "ktr0731/evans"
tap "lambdasawa/tap"
tap "leoafarias/fvm"
tap "lucagrulla/tap"
tap "mike-engel/jwt-cli"
tap "nektos/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "planetscale/tap"
tap "qmk/qmk"
tap "rhysd/hgrep", "https://github.com/rhysd/hgrep"
tap "stripe/stripe-cli"
brew "act"
brew "libpng"
brew "autoconf"
brew "automake"
brew "gmp"
brew "coreutils"
brew "asdf"
brew "xz"
brew "boost"
brew "python@3.10"
brew "aws-elasticbeanstalk"
brew "awscli"
brew "bash"
brew "bison"
brew "caddy"
brew "freetype"
brew "gettext"
brew "glib"
brew "libffi"
brew "pkg-config"
brew "python@3.9"
brew "checkov"
brew "clang-format"
brew "cmake"
brew "csvq"
brew "curl"
brew "direnv"
brew "docker", link: false
brew "docker-compose"
brew "dsq"
brew "gnutls"
brew "harfbuzz"
brew "jpeg", link: true
brew "gobject-introspection"
brew "libsodium"
brew "tesseract"
brew "ffmpeg"
brew "findomain"
brew "node"
brew "firebase-cli"
brew "fish"
brew "flyctl"
brew "gawk"
brew "gcc"
brew "gd"
brew "gh"
brew "ghq"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "gitleaks"
brew "glances"
brew "glow"
brew "gnu-time"
brew "libksba"
brew "gnupg"
brew "golang-migrate"
brew "gradle"
brew "graphqurl"
brew "grc"
brew "grep"
brew "grex"
brew "gron"
brew "hadolint"
brew "htop"
brew "httpie"
brew "hub"
brew "mysql-client"
brew "hydra"
brew "libheif"
brew "imagemagick"
brew "infracost"
brew "ios-webkit-debug-proxy"
brew "jc"
brew "jq"
brew "k6"
brew "ko"
brew "krb5"
brew "kubernetes-cli"
brew "leiningen"
brew "libedit"
brew "libiconv"
brew "libpq"
brew "libxml2"
brew "libzip"
brew "make"
brew "mas"
brew "maven"
brew "moreutils"
brew "yt-dlp"
brew "mpv"
brew "nghttp2"
brew "nginx"
brew "nkf"
brew "openapi-generator"
brew "openssh"
brew "openssl@3"
brew "pandoc"
brew "perl"
brew "portaudio"
brew "postgresql@14"
brew "ruby-build"
brew "rbenv"
brew "re2c"
brew "redis"
brew "rust"
brew "sbt"
brew "scrcpy"
brew "shellcheck"
brew "shfmt"
brew "slackcat"
brew "sops"
brew "sox"
brew "starship"
brew "tig"
brew "tmux"
brew "tmuxinator"
brew "tokei"
brew "translate-shell"
brew "tree"
brew "vim"
brew "wget"
brew "wireshark"
brew "xplr"
brew "youtube-dl"
brew "zoxide"
brew "arkweid/lefthook/lefthook"
brew "bufbuild/buf/buf"
brew "cloudflare/cloudflare/cloudflared", link: false
brew "dart-lang/dart/dart"
brew "guumaster/tap/hostctl"
brew "heroku/brew/heroku"
brew "ktr0731/evans/evans"
brew "lambdasawa/tap/curry"
brew "mike-engel/jwt-cli/jwt-cli"
brew "planetscale/tap/pscale"
brew "qmk/qmk/qmk"
brew "rhysd/hgrep/hgrep"
brew "stripe/stripe-cli/stripe"
cask "1password"
cask "1password-cli"
cask "android-studio"
cask "arduino"
cask "aws-vault"
cask "burp-suite-professional"
cask "clickup"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "dropbox"
cask "firefox"
cask "firefox-developer-edition"
cask "fitbit-os-simulator"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "intellij-idea"
cask "kindle"
cask "lens"
cask "ngrok"
cask "notion"
cask "obs"
cask "postman"
cask "rar"
cask "raycast"
cask "skype"
cask "slack"
cask "unity-hub"
cask "visual-studio-code"
cask "zoom"
mas "LINE", id: 539883307
mas "RunCat", id: 1429033973
mas "Xcode", id: 497799835
