brew "act"
brew "arkweid/lefthook/lefthook"
brew "asdf"
brew "autoconf"
brew "automake"
brew "aws-elasticbeanstalk"
brew "awscli"
brew "awscurl"
brew "bash"
brew "bison"
brew "boost"
brew "bufbuild/buf/buf"
brew "cfn-lint"
brew "clang-format"
brew "cmake"
brew "cocoapods"
brew "composer"
brew "coreutils", link: false
brew "csvq"
brew "curl"
brew "dart-lang/dart/dart"
brew "deno"
brew "direnv"
brew "docker", link: false
brew "dockerize"
brew "dsq"
brew "duf"
brew "dust"
brew "ffmpeg"
brew "ffmpeg@4"
brew "firebase-cli"
brew "fish"
brew "freetype"
brew "gawk"
brew "gcc"
brew "gd"
brew "gettext"
brew "gh"
brew "ghq"
brew "git"
brew "git-crypt"
brew "git-extras"
brew "git-lfs"
brew "gitleaks"
brew "glances"
brew "glib"
brew "glow"
brew "gmp"
brew "gnu-time"
brew "gnupg"
brew "gnutls"
brew "gobject-introspection"
brew "golang-migrate"
brew "gradle"
brew "graphqurl"
brew "graphviz"
brew "grc"
brew "grep"
brew "grex"
brew "gron"
brew "guile"
brew "guumaster/tap/hostctl"
brew "hadolint"
brew "harfbuzz"
brew "heroku/brew/heroku"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "ios-webkit-debug-proxy"
brew "jc"
brew "jless"
brew "jpeg", link: true
brew "jq"
brew "k6"
brew "ko"
brew "krb5"
brew "kubernetes-cli"
brew "lambdasawa/tap/curry"
brew "leiningen"
brew "libedit"
brew "libffi"
brew "libheif"
brew "libiconv"
brew "libksba"
brew "libpng"
brew "libpq"
brew "librsvg"
brew "libsodium"
brew "libxml2"
brew "libzip"
brew "make"
brew "mas"
brew "maven"
brew "md5sha1sum", link: false
brew "mike-engel/jwt-cli/jwt-cli"
brew "moreutils"
brew "mpv"
brew "mysql"
brew "mysql-client"
brew "netpbm"
brew "nghttp2"
brew "nginx"
brew "nkf"
brew "node"
brew "onefetch"
brew "openapi-generator"
brew "openssh"
brew "ouch"
brew "pandoc"
brew "perl"
brew "php"
brew "php-cs-fixer"
brew "php@8.0"
brew "php@8.1"
brew "pkg-config"
brew "planetscale/tap/pscale"
brew "portaudio"
brew "postgresql@14"
brew "procs"
brew "px4/px4/gcc-arm-none-eabi"
brew "python-yq"
brew "python@3.10"
brew "python@3.9"
brew "qmk/qmk/qmk", link: false
brew "rbenv"
brew "re2c"
brew "redis"
brew "rhysd/hgrep/hgrep", link: false
brew "ripgrep"
brew "ripgrep-all"
brew "ruby-build"
brew "rust"
brew "scrcpy"
brew "shellcheck"
brew "shfmt"
brew "slackcat"
brew "sox"
brew "starship"
brew "stripe/stripe-cli/stripe"
brew "terragrunt"
brew "tesseract"
brew "tfmigrate"
brew "tig"
brew "tmux"
brew "tmuxinator"
brew "tokei"
brew "translate-shell"
brew "tree"
brew "vim"
brew "watchexec"
brew "wireshark"
brew "xplr"
brew "xz"
brew "youtube-dl"
brew "yt-dlp"
brew "zoxide"
cask "1password"
cask "1password-cli"
cask "arduino"
cask "aws-vault"
cask "burp-suite-professional"
cask "discord"
cask "docker"
cask "firefox"
cask "firefox-developer-edition"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "jetbrains-toolbox"
cask "kindle"
cask "krisp"
cask "ngrok"
cask "rar"
cask "raycast"
cask "session-manager-plugin"
cask "skitch"
cask "slack"
cask "unity-hub"
cask "visual-studio-code"
cask "zoom"
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RunCat", id: 1429033973
mas "Xcode", id: 497799835
mas "iMovie", id: 408981434
tap "1password/tap"
tap "arkweid/lefthook"
tap "aws/tap"
tap "bufbuild/buf"
tap "cloudflare/cloudflare"
tap "dart-lang/dart"
tap "guumaster/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "knqyf263/utern"
tap "lambdasawa/tap"
tap "lucagrulla/tap"
tap "mike-engel/jwt-cli"
tap "nektos/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "planetscale/tap"
tap "px4/px4"
tap "qmk/qmk"
tap "rhysd/hgrep", "https://github.com/rhysd/hgrep"
tap "rs/tap"
tap "stripe/stripe-cli"
