brew "act"
brew "arkweid/lefthook/lefthook"
brew "asdf"
brew "autoconf"
brew "automake"
brew "aws-elasticbeanstalk"
brew "awscli"
brew "awscurl"
brew "bash"
brew "bison"
brew "boost"
brew "bufbuild/buf/buf"
brew "cargo-make"
brew "cfn-lint"
brew "clang-format"
brew "cmake"
brew "cocoapods"
brew "composer"
brew "coreutils"
brew "csvq"
brew "dart-lang/dart/dart"
brew "deno"
brew "direnv"
brew "docker", link: false
brew "dockerize"
brew "docutils"
brew "dsq"
brew "duf"
brew "dust"
brew "dynein"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "ffmpeg@4"
brew "ffuf"
brew "firebase-cli"
brew "fish"
brew "freetds"
brew "freetype"
brew "gawk"
brew "gcc"
brew "gd"
brew "gettext"
brew "gh"
brew "ghostscript"
brew "ghq"
brew "git"
brew "git-crypt"
brew "git-extras"
brew "git-lfs"
brew "gitleaks"
brew "glances"
brew "glib"
brew "glow"
brew "gmp"
brew "gnu-time"
brew "gnupg"
brew "gnutls"
brew "go-task"
brew "gobject-introspection"
brew "golang-migrate"
brew "gradle"
brew "graphqurl"
brew "graphviz"
brew "grc"
brew "grep"
brew "grex"
brew "gron"
brew "guile"
brew "guumaster/tap/hostctl"
brew "hadolint"
brew "harfbuzz"
brew "hashcat"
brew "heroku/brew/heroku"
brew "hexyl"
brew "htop"
brew "httperf"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "ios-webkit-debug-proxy"
brew "jc"
brew "jless"
brew "jpeg", link: true
brew "jq"
brew "jython"
brew "k6"
brew "ko"
brew "krb5"
brew "kubernetes-cli"
brew "lambdasawa/tap/curry"
brew "leiningen"
brew "libedit"
brew "libffi"
brew "libgit2"
brew "libheif"
brew "libiconv"
brew "libksba"
brew "libpng"
brew "libpq"
brew "librsvg"
brew "libsodium"
brew "libssh2"
brew "libxml2"
brew "libzip"
brew "make"
brew "mas"
brew "maven"
brew "md5sha1sum", link: false
brew "mike-engel/jwt-cli/jwt-cli"
brew "mitmproxy"
brew "moreutils"
brew "mpv"
brew "mysql"
brew "mysql-client"
brew "netpbm"
brew "nghttp2"
brew "nginx"
brew "nkf"
brew "node"
brew "onefetch"
brew "opa"
brew "openapi-generator"
brew "openssh"
brew "openssl@1.1"
brew "ouch"
brew "p7zip"
brew "pandoc"
brew "perl"
brew "php"
brew "php-cs-fixer"
brew "php@8.0"
brew "php@8.1"
brew "pillow"
brew "pkg-config"
brew "planetscale/tap/pscale"
brew "poetry"
brew "portaudio"
brew "postgresql@14"
brew "procs"
brew "px4/px4/gcc-arm-none-eabi"
brew "python-yq"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "qmk/qmk/qmk"
brew "rain"
brew "rbenv"
brew "re2c"
brew "redis"
brew "render-oss/render/render"
brew "rhysd/hgrep/hgrep"
brew "ripgrep"
brew "ripgrep-all"
brew "ruby-build"
brew "rust"
brew "scrcpy"
brew "shellcheck"
brew "shfmt"
brew "slackcat"
brew "sox"
brew "sqldef/sqldef/mysqldef"
brew "sqldef/sqldef/psqldef"
brew "starship"
brew "stripe/stripe-cli/stripe"
brew "tcl-tk"
brew "terragrunt"
brew "tesseract"
brew "tfmigrate"
brew "tig"
brew "tmux"
brew "tmuxinator"
brew "tokei"
brew "translate-shell"
brew "tree"
brew "unbound"
brew "vapoursynth"
brew "vim"
brew "virtualenv"
brew "wabt"
brew "watchexec"
brew "webp"
brew "websocat"
brew "wget"
brew "wireshark"
brew "xplr"
brew "xz"
brew "youtube-dl"
brew "yt-dlp"
brew "zoxide"
cask "1password"
cask "1password-cli"
cask "anaconda"
cask "arctype"
cask "arduino"
cask "authy"
cask "aws-vault"
cask "burp-suite-professional"
cask "charles"
cask "discord"
cask "docker"
cask "firefox"
cask "firefox-developer-edition"
cask "font-jetbrains-mono"
cask "gimp"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "insomnia"
cask "intellij-idea"
cask "kindle"
cask "krisp"
cask "ngrok"
cask "obsidian"
cask "owasp-zap"
cask "postman"
cask "rar"
cask "raycast"
cask "session-manager-plugin"
cask "skitch"
cask "slack"
cask "unity-hub"
cask "vagrant"
cask "virtualbox-beta"
cask "visual-studio-code"
cask "vivaldi"
cask "xquartz"
cask "zoom"
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RunCat", id: 1429033973
mas "Xcode", id: 497799835
mas "iMovie", id: 408981434
tap "1password/tap"
tap "adoptopenjdk/openjdk"
tap "arkweid/lefthook"
tap "aws/tap"
tap "bufbuild/buf"
tap "cloudflare/cloudflare"
tap "dart-lang/dart"
tap "guumaster/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "knqyf263/utern"
tap "lambdasawa/tap"
tap "lucagrulla/tap"
tap "mike-engel/jwt-cli"
tap "nektos/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "planetscale/tap"
tap "px4/px4"
tap "qmk/qmk"
tap "render-oss/render"
tap "rhysd/hgrep", "https://github.com/rhysd/hgrep"
tap "rs/tap"
tap "sqldef/sqldef"
tap "stripe/stripe-cli"
vscode "42Crunch.vscode-openapi"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "DiogoNolasco.pyinit"
vscode "EditorConfig.EditorConfig"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.vscode-pull-request-github"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-execution"
vscode "GraphQL.vscode-graphql-syntax"
vscode "KevinRose.vsc-python-indent"
vscode "KoichiSasada.vscode-rdbg"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "Shopify.ruby-extensions-pack"
vscode "Shopify.ruby-lsp"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "aws-scripting-guy.cform"
vscode "batisteo.vscode-django"
vscode "benjamin-simmonds.pythoncpp-debug"
vscode "bierner.github-markdown-preview"
vscode "bufbuild.vscode-buf"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "cmoog.sqlnotebook"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "franneck94.vscode-cpython-extension-pack"
vscode "franneck94.vscode-python-config"
vscode "franneck94.vscode-python-dev-extension-pack"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "janisdd.vscode-edit-csv"
vscode "jasonnutter.search-node-modules"
vscode "jq-syntax-highlighting.jq-syntax-highlighting"
vscode "k6.k6"
vscode "kddejong.vscode-cfn-lint"
vscode "kylejreed.deno-import-npm"
vscode "letrieu.expand-region"
vscode "lucax88x.codeacejumper"
vscode "lunaryorn.fish-ide"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "matthewpi.caddyfile-support"
vscode "mechatroner.rainbow-csv"
vscode "mindaro-dev.file-downloader"
vscode "mitchdenny.ecdc"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ricard.postcss"
vscode "richie5um2.vscode-sort-json"
vscode "run-at-scale.terraform-doc-snippets"
vscode "rust-lang.rust-analyzer"
vscode "sankethdev.vscode-proto"
vscode "scala-lang.scala"
vscode "skyapps.fish-vscode"
vscode "sorbet.sorbet-vscode-extension"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tcwalther.cython"
vscode "timonwong.shellcheck"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tsandall.opa"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vsls-contrib.gistfs"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "william-voyek.vscode-nginx"
vscode "wmaurer.change-case"
vscode "xabikos.JavaScriptSnippets"
vscode "xaver.clang-format"
vscode "ziyasal.vscode-open-in-github"
